#include<iostream>
using namespace std;
int main()
{
	setlocale(0, "rus");
	//1
	/*cout << "Поздравляю Всех с Новым\n\t\t\t2 \b 017\t\t\\\\через пробел\n\t\t\t\tгодом!\n";*/

	//2
	/*cout << "\"Выполнил задание\n\t\t(Левчук Евгений Андреевич)\n\t\t\t\t\tслушатель группы(с9б2_32)\"\n";*/

	//3
	/*cout << "----------------------\n";
	cout << "|  \\n  |  new line   |\n";
	cout << "----------------------\n";
	cout << "|  \\t  |     tab     |\n";
	cout << "----------------------\n";
	cout << "|  \\b  |  backspace  |\n";
	cout << "----------------------\n";
	cout << "|  \\\"  |      \"      |\n";
	cout << "----------------------\n";
	cout << "|  \\\'  |      \'      |\n";
	cout << "----------------------\n";
	cout << "|  \\\\  |      \\      |\n";
	cout << "----------------------\n";*/
	system("pause");
}