#include <iostream>
using namespace std;
int main()
{
	setlocale(0, "rus");
	//1

	/*int a, b;
	cout << "Введите два числа через пробел -> ";
	cin >> a >> b;
	(a % b == 0) ? cout << "Первое число кратное второму\n" : cout << "Первое число не кратное второму\n";*/

	//2

	/*float A, B, C;
	cout << "Введите три переменные -> ";
	cin >> A >> B >> C;
	((A < B)&&(A < C)&&(B < C)) ? cout << "A = " << 2 * A << " B = " << 2 * B << " C = " << 2 * C << "\n" : cout << "A = " << -1 * A << " B = " << -1 * B << " C = " << -1 * C << "\n";*/

	//3

	/*int A, B, C;
	cout << "Введите три переменные (две одинаковые) -> ";
	cin >> A >> B >> C;
	(A == B) ? cout << "Порядковый номер числа -> 3\n" : (A == C) ? cout << "Порядковый номер числа -> 2\n" : (B == C) ? cout << "Порядковый номер числа -> 1\n" : cout << "Порядковый номер числа определить невозможно так как не выполнены условия задачи\n";*/

	//4

	/*int A, B, C, AB, AC;
	cout << "Введите три точки -> ";
	cin >> A >> B >> C;
	AB = (A > B) ? A - B : B - A;
	AC = (A > C) ? A - C : C - A;
	(AB > AC) ? cout << "Точка С расположена ближе к A. Растояние -> " << AC << "\n" : cout << "Точка B расположена ближе к A. Растояние -> " << AB << "\n";*/
	system("pause");
}