#include <iostream>
using namespace std;

/* Задача 8. «Заповнення масиву». Заповнити масив квадратами натуральних чисел 1, 4, 9, 16, ... */

void main()
{
	// 1. оголошення лінійного масиву
	const int size = 20;
	// size - розмірність масиву (к-ть зарезервованих елементів)
	double mas[size];
	
	// 2. Введення робочої кількості елементів cnt 
	int cnt; // cnt <= size
	cout << " Enter cnt=";
	cin >> cnt;

	// 3. ініціалізація(заповнення) масиву
	for (int i = 0; i < cnt; i++)
		mas[i] = pow(i + 1, 2);

	// виведення масиву (початковий стан)

	// додаткових даних немає
	
	// обробка масиву не потрібна

	// 7. виведення результатів
	// виведення масиву
	cout << " Array mas: ";
	for (int i = 0; i < cnt; i++)
		cout << " " << mas[i];
	cout << endl;
}