#include <iostream>
using namespace std;

// Задача 3. ”Вставка елемента”. 
// У заданий масив вставити на k-те місце значення х.

void main()
{
	// 1. оголошення лінійного масиву
	const int size = 20;
	// size - розмірність масиву (к-ть зарезервованих елементів)
	double mas[size];

	// 2. Введення робочої кількості елементів cnt 
	int cnt; // cnt <= size
	cout << " Enter cnt=";
	cin >> cnt;

	// 3. ініціалізація (введення) масиву
	for (int i = 0; i < cnt; i++)
	{
		cout << " Enter mas[" << i << "]=";
		cin >> mas[i];
	}

	// 4. виведення масиву (початковий стан)
	cout << " Array mas: ";
	for (int i = 0; i < cnt; i++)
		cout << " " << mas[i];
	cout << endl;

	// 5. Введення додаткових даних
	int k; // індекс нового елемента
	cout << " Enter index k=";
	cin >> k;
	double x; // значення нового елемента
	cout << " Enter value x=";
	cin >> x;

	// 6. обробка масиву - зсуваємо наступні елементи з кінця
	for (int i = cnt; i > k; i--)
		mas[i] = mas[i - 1]; 

	mas[k] = x; // вставляємо значення на позицію з індексом k
	
	cnt++;  // елемент вставлено, довжина збільшилася

	// 7. виведення результатів
	// в цій задачі результатом є сам масив
	// виведення масиву (кінцевий стан)
	cout << " Array mas: ";
	for (int i = 0; i < cnt; i++)
		cout << " " << mas[i];
	cout << endl;
}