#include <iostream>
using namespace std;

/* ≤н≥ц≥ал≥зац≥€ масиву при оголошенн≥ */

void main()
{
	// оголошенн€ л≥н≥йного масиву
	int x[10];
	int y[10] = {11, 12, 13, 14, 15, 16, 17};
	/* оголошено 10 елемент≥в, ≥н≥ц≥ал≥зовано перших 7,
		≥нш≥ автоматично заповнюютьс€ нул€ми */
	int z[] = {101, 102, 103, 104, 105};
	/* оголошена та к≥льк≥сть, €ка ≥н≥ц≥ал≥ована, 
		тобто 5 штук */

	// введенн€ л≥н≥йного масиву
	for (int i = 0; i < 10; i++)
	{
		cout << " Enter x[" << i << "]=";
		cin >> x[i];
	}

	// виведенн€ л≥н≥йного масиву x
	cout << " Array x: ";
	for (int i = 0; i < 10; i++)
		cout << " " << x[i];
	cout << endl;

	// виведенн€ л≥н≥йного масиву y
	cout << " Array y: ";
	for (int i = 0; i < 10; i++)
		cout << " " << y[i];
	cout << endl;
	
	// виведенн€ л≥н≥йного масиву z
	cout << " Array z: ";
	for (int i = 0; i < 10; i++)
		cout << " " << z[i];
	cout << endl;
	// на екран виводитьс€ см≥тт€ та ком≥рки, що масиву не належать
	// звертатис€ до ком≥рок, €к≥ масиву не належать дуже Ќ≈ѕ–ј¬»Ћ№Ќќ
}